In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', np.nan],
'Age': [25, 30, np.nan, 22, 23],
'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston'],
'Salary': [50000, 60000, 55000, 45000, np.nan]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
print("Original Dataset:")
print(df)

Original Dataset:
      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  30.0  Los Angeles  60000.0
2  Charlie   NaN      Chicago  55000.0
3    David  22.0          NaN  45000.0
4      NaN  23.0      Houston      NaN

In [5]:
print("\nNull Values in the Dataset:")
print(df.isnull())

Null Values in the Dataset:
    Name    Age   City  Salary
0  False  False  False   False
1  False  False  False   False
2  False   True  False   False
3  False  False   True   False
4   True  False  False    True

In [6]:
df_cleaned = df.dropna()

In [7]:
print("\nDataset after removing rows with null values:")
print(df_cleaned)

Dataset after removing rows with null values:
    Name   Age         City   Salary
0  Alice  25.0     New York  50000.0
1    Bob  30.0  Los Angeles  60000.0